docs: update readme with mermaid
